Revit 2024 API
Railing.RemoveHost Method
 Removes the association between the railing and its host.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void RemoveHost()
Visual Basic
Public Sub RemoveHost
Visual C++
public:
void RemoveHost()
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace